(function() {
    this.mc_category_city_limit = [
        [39.90748, 116.391372, "北京特殊禁飞区", "北京", "China", 30],
        [42.83, 93.52, "东疆:哈密特殊禁飞区", "东疆:哈密", "China", 5],
        [42.97, 89.18, "东疆:吐鲁番特殊禁飞区", "东疆:吐鲁番", "China", 5],
        [47.82, 88.13, "北疆:阿勒泰市特殊禁飞区", "北疆:阿勒泰市", "China", 5],
        [43.85, 87.58, "北疆:乌鲁木齐特殊禁飞区", "北疆:乌鲁木齐", "China", 20],
        [44.01, 87.29, "北疆:昌吉特殊禁飞区", "北疆:昌吉", "China", 6],
        [44.31, 86.05, "北疆:石河子特殊禁飞区", "北疆:石河子", "China", 8],
        [44.43, 84.89, "北疆:奎屯特殊禁飞区", "北疆:奎屯", "China", 7],
        [44.33, 84.89, "北疆:独山子特殊禁飞区", "北疆:独山子", "China", 5],
        [45.58, 84.88, "北疆:克拉玛依特殊禁飞区", "北疆:克拉玛依", "China", 6],
        [46.73, 82.99, "北疆:塔城特殊禁飞区", "北疆:塔城", "China", 5],
        [44.89, 82.07, "北疆:博乐特殊禁飞区", "北疆:博乐", "China", 5],
        [43.91, 81.33, "北疆:伊宁特殊禁飞区", "北疆:伊宁", "China", 8],
        [41.72, 86.18, "南疆:库尔勒特殊禁飞区", "南疆:库尔勒", "China", 9],
        [41.16, 80.27, "南疆:阿克苏特殊禁飞区", "南疆:阿克苏", "China", 7],
        [37.11, 79.93, "南疆:和田特殊禁飞区", "南疆:和田", "China", 7],
        [37.88, 77.43, "南疆:叶城特殊禁飞区", "南疆:叶城", "China", 5],
        [38.42, 77.25, "南疆:莎车特殊禁飞区", "南疆:莎车", "China", 5],
        [39.69, 76.2, "南疆:阿图什特殊禁飞区", "南疆:阿图什", "China", 5],
        [39.48, 76, "南疆:喀什特殊禁飞区", "南疆:喀什", "China", 8],
        [41.72, 82.99, "南疆:库车特殊禁飞区", "南疆:库车", "China", 8],
        [38.8976049, -77.0363765, "White house", "Washington", "United States ", 25],
        [35.685292, 139.753132, "Japan's Imperial Place", "Chiyoda-ku", "Japan", 1.131],
        [35.67452, 139.744677, "Prime Minister of Japan and His Cabinet", "Chiyoda-ku", "Japan", .993]
    ]
}).call(this);